Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: Carbon dioxide for the most part is traveling within the plasma.
ht: Kabòn pou pati ki plis se vwayaje nan a ikid ki nan san.

source: It gets absorbed into the actual fluid and I'll talk about it in a future video.
ht: Li vin pèdi nan likid aktyèl la Et m' ap pale sou sa nan tan kap vini yon videyo.

source: It's actually in a slightly different form.
ht: Sa ki aktyèlman yon fòm yon ti jan diferan.

source: It's as carbonic acid and that's actually a key point for how the plasma knows where to dump the oxygen, but I'll talk about that in a future video.
ht: Se tankou asid; Et se aktyèlman yon kle pwen pou jan a ikid ki nan san konnen kote pou image oksijèn an, men, m' ap pale sou sa nan tan kap vini yon vidéo.

source: But over here, this red blood cell has a bunch of hemoglobin proteins in it, but those hemoglobin proteins have dumped their oxygen.
ht: Men isit la, sou globil wouj sa a gen yon pakèt moun moglobin protéines ladan l, men, sa protéines moglobin ont L' oksijèn yo.

source: And it actually turns out it's the hemoglobin-- so with oxygen, hemoglobin looks red.
ht: Et li aktyèlman active se moglobin a - konsa oksijèn, moglobin recherche wouj.

source: It reflects red light.
ht: Li reflete limyè wouj.

source: When it doesn't have oxygen, hemoglobin does not look red.
ht: Lè l' pa gen oksijèn, moglobin pa gade wouj.

source: It looks kind of purplish, bluish, darkish-- something.
ht: Li sanble ti jan-, vert, darkish - yon bagay.

source: And that's why in most of your body, your veins that have de-oxygenated red blood cells look kind of bluish.
ht: Et se poutèt nan anpil nan sant kò ou, ou varis ki gen de-oxygenated selil wouj gade ti jan vert.

source: And the reason why it changes color is that when the oxygen bonds to the hem sites on the hemoglobin, it actually changes the entire confirmation, the entire structure of the protein.
ht: La raison poukisa li chanje koulè, se sa lè a oksijèn obligations lokal fè woulèt yo sou moglobin a, li aktyèlman chanje konfimasyon an antye, toute la èstrikti de protéines a.

source: We've see that multiple times.
ht: N ap wè sa plizyè fwa.

source: The whole protein folds in such a way that all of a sudden, instead of purplish or dark light being reflected, now red light is reflected.
ht: A tout protéines se yon jan pou tout yon sanzatann, olye ke yo te reflete limyè- ou tou nwa Koulye a limyè wouj reflete.

source: And that's why red blood cells will become red once they take the oxygen.
ht: Se poutèt sa yo ak globil wouj nan san ap tounen wouj yon fwa yo pran oksijèn an.

source: But I'm going on a tangent.
ht: Men, m' ap kouri tanjant yon.

source: The whole point here is saying, why we taking up so much more oxygen than nitrogen, given that there's less oxygen in the atmosphere than nitrogen?
ht: A tout pwen isit la vle di menm: poutèt nou pran pou oksijèn pi plis pase Azòt, bay gen mwens oksijèn nan atmosfè a pase Azòt?

source: And the key is these red blood cells.
ht: Et kle a se selil wouj sa yo.

source: These red blood cells have these millions of hemoglobin proteins inside of them and they take them up and they sop up all of the oxygen out of the plasma.
ht: Selil wouj sa yo gen sa yo dè milyon de moglobin protéines anndan de yo epi yo pran yo ak yo sop leve tout oksijèn soti nan a ikid ki nan san.

source: Actually, they sop about 98.5% of the oxygen.
ht: Aktyèlman, yo sop Sur 98.5% de oksijèn an.

source: So these red blood cells are just traveling and they're going to go back to the heart.
ht: Se konsa selil wouj sa yo sèlman vwayaje ak yo pwal pou tounen nan kè moun.

source: They are what make our blood red.
ht: Yo se sa fè nou san wouj.

source: So you have this thing, hemoglobin, that's sitting in red blood cells.
ht: Se konsa, ou gen bagay sa a, moglobin, ki te chita nan globil wouj nan san.

source: It's sopping up all the oxygen.
ht: Li sopping leve tout oksijèn an.

source: So it keeps the oxygen concentration and the actual plasma low.
ht: Se konsa, li kenbe konsantrasyon oksijèn an Et la réel ikid ki nan san faibles.

source: You have nothing like that for nitrogen.
ht: Ou pa gen anyen konsa pou Azòt.

source: There is no cell that's sopping up the nitrogen.
ht: Pa gen pa selil ki sopping moute Azòt a.

source: Nitrogen does not bond to hemoglobin.
ht: Azòt pa bond pou moglobin.

source: So that's why oxygen is taken up so much better than nitrogen.
ht: Se konsa, se poutèt sa oksijèn pran moute sa nou pa bezwen pi bon pase Azòt.

source: It's a very interesting question because if you just think about how much nitrogen is, it's kind of a very natural idea.
ht: Li yon très enteresan kesyon paske si ou simplement panse osijè de kòman Azòt se, se ti jan yon trè idée natirèl.

source: Now I want to focus a little bit on the red blood cell itself because it's fascinating.
ht: Koulye a mwen vle yon ti jan vize sou globil wouj tèt li paske li fascinante.

source: In the video on the structure of the cell, I start off saying, all cells have a membrane and they all have DNA.
ht: Nan videyo sou èstrikti sèlil a, mwen kòmanse pran li di:-tout cellules a gen yon len Et yo tout gen DNA.

source: Now, the fascinating thing about a red blood cell-- I already said it has millions of hemoglobin molecules or proteins inside of it.
ht: Jouk koulye a, fascinante bagay osijè de yon wouj lobil - m te deja di li gen dè milyon de molécules moglobin ou protéines andedan li.

source: The fascinating thing about a red blood cell-- it has no nucleus.
ht: Fascinante bagay osijè de yon san wouj selil - li gen okenn nannan.

source: And no DNA.
ht: Et ADN pa.

source: This is mind boggling when I first found out.
ht: Sa se lide boggling lè mwen anvan te konstate.

source: I was like, well, why is it a cell?
ht: Mwen te tankou, byen, Poukisa se yon selil?

source: Is it really even a living thing?
ht: Se vrèman menm yon bagay ki rete?

source: And it turns out when it's growing, it does have a nucleus.
ht: Et devient lè li an ap grandi, li gen yon nannan.

source: All cells need a nucleus with DNA in order to generate the proteins that build it up, in order to exist and structurally make itself the way it needs to be made, but the whole point of a red blood cell is to contain as much hemoglobin as possible.
ht: Tout cellules bezwen yon nannan ak DNA pou jenere a protéines ki konstwi l, pou yo egziste Et structurellement fè li menm jan li bezwen pou fè, men tout pwen globil wouj yon se pou mete pi fò moglobin ke nou kapab.

source: And so you can imagine, this is actually a favorable evolutionary trait, that as red blood cells are ready to go into business, you've built the whole structure, they actually get rid of their nucleus.
ht: Se konsa, ou ka konprann, se aktyèlman yon favorab évolution caractéristique, ki tankou globil wouj nan san nou prè pou nou ale nan biznis, ou te konstwi tout sipò, yo aktyèlman kab nannan yo.

source: They actually push their nucleus out of the cell and the whole reason why that's beneficial is, that's more space for hemoglobin.
ht: Yo aktyèlman pouse nannan yo soti nan selil a Et la raison tout Poukisa sa se bénéficiaire se, se plis plas pou moglobin.

source: Because the more hemoglobin you have, the more oxygen you can take up.
ht: Paske a moglobin plis ou gen, a plis oksijèn ou kapab pran.

source: And I can do a ton of videos on hemoglobin and all of that-- and actually, I'm going to do a lot more on the circulatory system so don't worry about that, but I want to go over one other really interesting thing about hemoglobin.
ht: E mwen kapab fè yon paj de vidéos sou moglobin Et tout de sa ­ e aktyèlman, mwen pral fè anpil plis sou a san/sikilatwa se konsa pa enkyete w pou kesyon sa, men, mwen vle kote moun ap pase yon sèl bagay lòt reyèlman enteresan osijè de moglobin.

source: We already talked about red blood cells.
ht: Te nou deja pale osijè de globil wouj nan san.

source: I think it's fascinating that they actually don't have a nucleus in their mature form.
ht: Mwen panse li se fascinante ke yo pa gen aktyèlman yon wayo nan fòm matirite yo.

source: They actually have very short lives.
ht: Yo aktyèlman gen lavi trè kout.

source: They live maybe 80, 120 days so they're not these long lived cells-- so it's almost a philosophical question.
ht: Yo rete petèt 80, 120 jou pou ke yo pa sa lontan viv cellules - se poutèt sa se pwèske yon filozofik kesyon.

source: Are are they still alive once they've lost their DNA or are they just vessels for oxygen that aren't really alive because they aren't regenerating and producing their own DNA?
ht: Sont yo toujou vivan yon fwa ke yo pèdi DNA yo ou sont yo jis kèk bagay pou oksijèn sa pa vrèman an vi paske yo pa régénération li, si DNA pwòp?

source: So actually, instead of going into the hemoglobin discussion right now, I'll leave you there in this video.
ht: Aktyèlman, plas yo va antre nan moglobin diskisyon byen cho dwa koulye a, m' ap kite ou la nan videyo sa a.

source: I realize I've been making 20-minute videos where my goal is really to make ten-minute ones.
ht: Mwen rann kont mwen te gen te fè 20 minit videyo sou kote m' objectif Se vrèman fè dis minit ceux.

source: So I'll leave you here and in the next video, we'll talk more about hemoglobin and the circulatory system.
ht: Se poutèt sa, m' ap kite ou isit la ak nan videyo kap vini an, nou pral pale plis sou moglobin Et la san/sikilatwa.

source: In the last video, I showed you what a neuron looked like and we talked about the different parts of a neuron, and I gave you the general idea what a neuron does.
ht: Nan dènye videyo a, m' a ou sa yon ewonn sanble tankou e nou te pale osijè de diferan pati de yon ewonn, e mwen te ba ou a jeneral idée ewonn ki fè.

source: It gets stimulated at the dendrites-- and the stimulation we'll talk about in future videos on what exactly that means-- and that that impulse, that information, that signal gets added up.
ht: Li jwenn stimuler nan dendrites yo - Et la animasyon n a pale sou vidéos nan tan kap vini sou sa egzakteman sa vle di - Et sa ide sa, sa enfòmasyon sa, sa signal gen te ajoute.

source: If there's multiple stimulation points on various dendrites, it gets added up and if it meets some threshold
ht: Si ta gen plizyè ankourajman pwen sou divers dendrites, li jwenn te ajoute Et si li aux kèk pou sekirite sosyal kiyè, li pwal kreye potentiel aksyon sa a ou siy sa yo se Sur axon a e petèt stimule

source: level, it's going to create this action potential or signal that travels across the axon and maybe stimulates other neurons or muscles because these terminal points of the axons might be connected to dendrites of other neurons or to muscle cells or who knows what.
ht: lòt neurones ou frèt paske sa yo pwen de fè de l' axons peuvent être koneksyon ak dendrites de neurones lòt ou pou cellules nan pye ou ki konnen ki sa.

source: But what I want to do in this video is kind of lay the building blocks for exactly what this signal is or how does a neuron actually transmit this information across the axon-- or really, how does it go from the dendrite all the way to the axon?
ht: Men sa mwen vle pou yo fè nan videyo sa a ti jan de fixer a blòk bati pou ekzateman kisa siyal sa a se ou ki jan fè yon ewonn aktyèlman transmèt enfòmasyon sa a dans la axon - ou se vre, jan fè l' pase de la dendrite pou axon a, jouk yo rive?

source: Before I actually even talk about that, we need to kind of lay the ground rules-- or a ground understanding of the actual voltage potential across the membrane of a neuron.
ht: Anvan mwen aktyèlman jouk pale sou sa, nou bezwen ti jan de fixer pwensip - ou yon baz konpweyansyon de la réel vòltaj potansyèl dans la

source: And, actually, all cells have some voltage potential difference, but it's especially relevant when we talk about a neuron and its ability to send signals.
ht: Men yo, aktyèlman, tout cellules vòltaj kèk gwo diferans, men li a ak enpòtan sitou lè nou pale osijè ewonn yon ak abilite pou voye siyal yo.

source: Let's zoom in on a neuron's cell.
ht: An n rale sou selil ewonn yon. Mwen te kapab rale sou tout pwen sou yon selil sa a ki pa kouvri anba yon gaine la.

source: I'm going to zoom in on its membrane.
ht: M ap rale sou len li.

source: So let's say that this is the membrane of the neuron, just like that.
ht: Se konsa nou di ke sa se len de la ewonn, menm jan sa.

source: That's the membrane.
ht: Sa se len a.

source: This is outside the neuron or the cell.
ht: Sa se deyò a ewonn ou sèlil a.

source: And then this is inside the neuron or the cell.
ht: Et puis sa se anndan ewonn a ou sèlil a.

source: Now, you have sodium and potassium ions floating around.
ht: Koulye a, ou gen odyòm Et Potasyòm ions flotan environ.

source: I'm going to draw sodium like this.
ht: M ap trase odyòm kon sa.

source: Sodium's going to be a circle.
ht: Odyòm a va fè yon wonn.

source: So that's sodium and their positively charged ions have a plus one charge and then potassium, I'll draw them as little triangles.
ht: Se konsa, sa se odyòm Et ions pozitivman accusé yo gen yon plis yon sèl frais Et puis Potasyòm, m' ap trase yo tankou ti sipèpoze.

source: So let's say that's potassium-- symbol for potassium is K.
ht: Se konsa nou di sa se afè Potasyòm - senbòl pou Potasyòm se Kollagunta

source: It's also positively charged.
ht: Li te chaje tou pozitivman.

source: And you have them just lying around.
ht: E ou gen yo jis s' environ.

source: Let's say we start off both inside and outside of the cell.
ht: An n pale nou kòmanse off dans les Et deyò sèlil a. Yo ap akize poutèt tout pozitivman.

source: Sodium inside, some sodium outside.
ht: Sodyòm anndan, kèk odyòm deyò.

source: Now it turns out that cells have more positive charge outside of their membranes than inside of their membranes.
ht: Kounye a li active cellules gen plis pozitif frais deyò de membranes yo pase L' membranes yo.

source: So there's actually a potential difference that if the membrane wasn't there, negative charges would want to escape or positive charges or positive ions would want to get in.
ht: Se konsa, pa gen aktyèlman yon gwo différence si sa len a pa t la, négatif akizasyon ta vle pou yo vole gagè ou chaj pozitif ou ions pozitif ta vle wè ap rive.

source: The outside ends up being more positive, and we're going to talk about why.
ht: Sa a deyò a fini être plis pozitif, nou pral pale osijè poutèt. Se poutèt sa yon elèktrik dégradé potansyèl, dwat?

source: If this is less positive than that-- if I have a positive charge here, it's going to want to go to the less positive side.
ht: Si sa mwens pozitif pase sa ki si mwen gen yon pozitif frais isit la, li pwal vle ale a te ranmase pi piti bò kote ki pozitif.

source: It's going to want to go away from the other positive charges.
ht: Li pwal vle al wete l ' nan a lòt chaj pozitif.

source: It's repelled by the other positive charges.
ht: Li repoussée pa lòt chaj pozitif.

source: Likewise, if I had a negative charge here, it'd want to go the other side-- or a positive charge, I guess, would be happier being here than over here.
ht: Apadesa, si mwen te yon chaj negatif isit la, li ta vle ale lòt bò - ou yon chaj pozitif, mwen panse, ta dwe zak étant la pase sou isit la.

source: But the question is, how does that happen?
ht: Men kesyon an, kouman sa fè rive?

source: Because left to their own devices, the charges would disperse so you wouldn't have this potential gradient.
ht: Paske te kite pou pwòp périphériques, chaj yo ta dispèse pou ou pa gen gwo dégradé sa a.

source: Somehow we have to put energy into the system in order to produce this state where we have more positive on the charge of the outside than we do on the inside.
ht: Enpòt kijan nou gen pou voye yo jete enèji nan sistèm nan lòd a pwodwi ki kote nou gen plis pozitif nan leta sa a frais de deyò a pase nou fè vlope tripay la.

source: And that's done by sodium potassium pumps.
ht: Et, ki fè odyòm Potasyòm pompes.

source: I'm going to draw then a certain way.
ht: M pral fè lè sa a yon sèten fason.

source: This is obviously not how the protein actually looks, but it'll give you a sense of how it actually pumps things out.
ht: Men evidamman pa jan protéines a aktyèlman recherche, men l ap ba ou yon sans de jan li aktyèlman pompes sa soti. M ap trase ki bò kote de protéines a.

source: Maybe it looks like this and you'll have a sense of why I drew it like this.
ht: Gen dwa li sanble ke sa a ak nou pwal genyen yon sans de poutèt mwen a li kon sa.

source: So that side of the protein or the enzyme-- and then the other side, I'll draw it like this.
ht: Konsa, côté de protéines a ou nzim a - Et puis la lòt bò lanmè, m' ap trase li kon sa.

source: It looks something like this, and of course the real protein doesn't look like this.
ht: Li sanble yon bagay tankou sa a, ak de men wi a protéines reyèl pa sanble tankou sila a.

source: You've seen me show you what proteins really look like.
ht: Ou te wè m montre ou protéines ki vrèman sanble.

source: They look like big clusters of things, hugely complex.
ht: Yo sanble nan gwo gran bagay, rete ankò lajman koze ki senp.

source: Different parts of the proteins can bond to different things and when things bond to proteins, they change shape.
ht: Diferan pati de protéines yo kapab bond pou diferan ansanm ak lè bagay bond protéines, pou yo chanje fòm.

source: But I'm doing a very simple diagram here and what I want to show you is, this is our sodium potassium pump in its inactivated state.
ht: Men, m' ap fè yon senp dyagram isit la ak sa mwen vle pou montre w se, se sa rele ponp Potasyòm odyòm nou nan li eta désactivé.

source: And what happens in this situation is that we have these nice places where our sodium can bind to.
ht: Sa k rive nan sitiyasyon sa a se pou nou fè sa bon plas kote odyòm nou ka mare pou yo.

source: So in this situation, sodium can bind to these locations on our enzyme or on our protein.
ht: Se konsa nan sitiyasyon sa a, odyòm ka mare pou sa yo kote yo ye nzim nou ou sou protéines nou.

source: And if we just had the sodiums bind and we didn't have any energy going into the system, nothing would happen.
ht: Et si nou jis te la Liaison sodiums Et nou pa t gen okenn enèji va antre nan sistèm nan, pa gen anyen ki pwal pase.

source: It would just stay in this situation.
ht: Li ta rete jis nan sitiyasyon sa a.

source: The actual protein might look like something crazy.
ht: Protéines aktyèl la te ka gade tankou yon bagay fou.

source: The actual protein might be this big cloud of protein and then your sodiums bond there, there, and there.
ht: Protéines aktyèl la te ka sa a gwo nwaj de protéines Et Lè sa a ou sodiums bond la a, gen, Et la.

source: Maybe it's inside the protein somehow, but still, nothing's going to happen just when the sodium bonds on this side of the protein.
ht: Gen dwa se anndan protéines la une, men, anyen an rive fèt sèlman lè a odyòm obligations sou bò sa a protéines a.

source: In order for it to do anything, in order for it to pump anything out, it uses the energy from ATP.
ht: Nan lòd pou l' fè sa, nan lòd pou pompe anyen deyò, li itilize enèji de ATP.

source: So we had all those videos on respiration and I told you that ATP was the currency of energy in the cell-- well, this is something useful for ATP to do.
ht: Se konsa nou te gen tout vidéos sa sou bouch nan bouch e mwen te di ou ATP sa te sikilasyon an de enèji nan selil a - byen, genyen sa se yon bagay bon pou ATP pou yo fè.

source: ATP-- that's adenosine triphosphate-- it might go to some other part of our enzyme, but in this diagram maybe it goes to this part of the enzyme.
ht: ATP - sa se-triphosphate-l' te ka ale nan kèk lòt pati nzim nou, men nan men diagram li gen dwa se pou sa a pati nzim a.

source: And this enzyme, it's a type of ATPase.
ht: Et nzim sa a, se yon jan de ATPase.

source: When I say ATPase, it breaks off a phosphate from the ATP-- and that's just by virtue of its shape.
ht: Lè m' di ATPase, li kase tout yon phosphate de ATP- e se pou sa sèlman by virtue of fòm li.

source: It's able to plunk it off.
ht: Sa ka plunk l' nèt.

source: When it plunks off the phosphate, it changes shape.
ht: Lè l' plunks sou phosphate a, li chanje fòm.

source: So step one, we have sodium ions-- and actually, let's keep count of them.
ht: Se konsa kanpe yonn, nou genyen odyòm ions - Et aktyèlman, an n kenbe konte yo.

source: We have three sodium-- these are the actual ratios-- three sodium ions from inside the cell or the neuron.
ht: Nou genyen twa Sodyòm-sa yo a réel pousantaj ki bobo-twa odyòm ions de anndan sèlil a ou ewonn a.

source: They bond to pump, which is really a protein that crosses our membrane.
ht: Yo bond pou ponp, ki se vrèman yon pwoteyin ke Croix len nou.

source: Now, step two, we have also ATP.
ht: Koulye a, étape de, nou gen tou ATP.

source: ATP gets broken into ATP plus phosphate on the actual protein and that changes the shape.
ht: ATP obtient kraze nan ATP plis phosphate sou aktyèl la protéines Et ki chanje fòm lan.

source: So that also provides energy to change pump's shape.
ht: Se poutèt sa tou fournit enèji pou chanje fòm ponp a. Koulye a, sa se lè ponp la te la anvan.

source: Now after, our pump might look something like this.
ht: Koulye a Apre sa, ponp nou te gade yon bagay konsa.

source: Let me clear out some space right here.
ht: Lage m konnen kèk plas droit isit la.

source: I'll draw the after pump right there.
ht: M ap trase a ponp après la a. Ansanm ak sa a devan yo.

source: After the phosphate gets split off of the ATP, it might look something like this.
ht: Apwè phosphate a vin separe delivre a ATP, li te ka gade yon bagay tankou sa a.

source: Instead of being in that configuration, it opens in the other direction.
ht: Olye de cours nan sa configuration, li te ouvè nan a lòt bò.

source: So now it might look something like this.
ht: Men koulye a li te ka gade yon bagay konsa.

source: And of course it's carrying these phosphate groups.
ht: Et natirèlman li pote gwoup phosphate sa yo.

source: They have a positive charge.
ht: Yo gen yon chaj pozitif. Li louvri kon sa.

source: This side now looks like this.
ht: Kote sa a koulye a parèt tankou sa a.

source: So now the phosphates are released to the outside.
ht: Men koulye a phosphates sont libere lan.

source: So they've been pumped to the outside.
ht: Se konsa yo te fin pompe lan.

source: Remember, this is required energy because it's going against the natural gradient.
ht: Pa bliye, se enèji mande l paske li pwal kont a dégradé natirèl.

source: You're taking positive charge and you're pushing them to an environment that is even more positive and you're also taking it to an environment where there's already a lot of sodium, and you're putting more sodium there.
ht: Ou ap jwe ak pozitif frais Et ou ap pouse yo pou yon anviwònman ki pi plis toujou. nou pozitif Et ou ap tou y' a pou anviwònman yon kote ki genyen deja anpil Sodyòm, Et n' ap mete plis odyòm la.

source: So you're going against the charge gradient and you're going against the sodium gradient.
ht: Se konsa ou pral sou a dégradé frais Et ou obeyi a dégradé Sodyòm.

source: But now-- I guess we call it step three-- the sodium gets released outside the cell.
ht: Men, koulye a - mwen panse nou rele l' étape twa - odyòm a obtient libere deyò sèlil a.

source: And when this changes shape, it's not so good at bonding with the sodium anymore.
ht: Lè sa a chanje fòm, bon bagay se pa konsa nan Liaison ak a odyòm ankò.

source: So maybe these can become a little bit different too, so that the sodium can't even bond in this configuration now that the protein has changed shape due to the ATP.
ht: Se konsa gen dwa sa yo ka vin yon ti diferan tou, se konsa sa odyòm a pa ka menm bond nan configuration sa a koulye a sa protéines a te chanje fòm akòz ATP a.
